Repository: JanBulling/outfitable-mobile
Catalog: lib/lang/app_*.arb
Languages: de

# clothing_type
source: {type, select, 0{Dress} 1{Hoodie} 2{Longsleeve} 3{Pants} 4{Shirt} 5{Shorts} 6{Skirt} 7{T-Shirt} other{-}}
de: {type, select, 0{Kleid} 1{Hoodie} 2{Longsleeve} 3{Hose} 4{Hemd} 5{Kurze Hose} 6{Rock} 7{T-Shirt} other{-}}

# clothing_temperatures
source: {temp, select, 0{Icy} 1{Cold} 2{Moderate} 3{Warm} 4{Hot} other{-}}
de: {temp, select, 0{Eisig} 1{Kalt} 2{Angenehm} 3{Warm} 4{Heiß} other{-}}

# clothing_parts
source: {part, select, 0{Top Part} 1{Lower Part} 2{Both} other{-}}
de: {part, select, 0{Oberteil} 1{Unterteil} 2{Beides} other{-}}

# clothing_style
source: {style, select, 0{Casual} 1{Formal} 2{Sports} other{-}}
de: {style, select, 0{Casual} 1{Formal} 2{Sport} other{-}}

# outfit_message_too_cold
source: It could be a little too cold with this outfit
de: Es könnte etwas zu kalt sein für das Outfit.

# outfit_message_too_hot
source: It could be a little too warm with this outfit
de: Es könnte etwas zu warm sein für das Outfit.

# outfit_message_raining
source: It is raining today. Consider taking a jacket
de: Heute regnet es. Nimm eine Jacke mit!

# outfit_message_stormy
source: It is a little stormy today. Consider taking a jacket.
de: Heute stürmt es. Nimm eine Jacke mit!

# outfit_message_snowing
source: It is goingt to snow today.
de: Es schneit heute. Numm eine Jacke mit!

# outfit_message_no_weather_data
source: Not sure if this outfit fits. We don't have any weather data available.
de: Wir sind nicht sicher, ob das Outfit passt. Wir haben keine Wetter-Daten zur Verfügung.

# outfit_message_error
source: There was an error while generating the outfit.
de: Etwas ist schief gelaufen bei der Generierung des Outfits.

# outfit_message_not_enough_clothing
source: No Outfit could be generated because there is no fitting piece for you.
de: Es konnte kein Outfit genertiert werden, weil nicht genug Kleidung vorhanden war.

# outfit_message_wrong_style
source: Not exactly the style you wanted, but it is the best, we could find.
de: Nicht der Style, den du wolltest, aber das beste, das wir erstellen konnten.

# closet_tab
source: Closet
de: Kleiderschrank

# favorites_tab
source: Favorites
de: Favoriten

# profile_tab
source: Profile
de: Profil

source: Add new clothing
de: Neue Kleidung hinzufügen

source: Add clothing
de: Kleidung hinzufügen

source: Daily outfit
de: Tägliches Outfit

source: Generated outfit:
de: Generiertes Outfit:

# outfit_pieces
source: Outfit piecec:
de: Outfit Teile:

source: Save outfit
de: Outfit speichern

source: New outfit
de: Neues Outfit

source: Select
de: Asuwählen

source: Select clothing type
de: Kleidungstyp auswählen

# select_clothing_style
source: Select style
de: Style auswählen

# select_clothing_temperature
source: Select optimal temperature
de: Optimale Teperatur auswählen

source: Add
de: Hinzufügen

source: Select color
de: Farbe wählen

source: Change color
de: Farbe ändern

source: Classify Clothing
de: Kleidung erkennen

# detected_clothing_type
source: Detected a {type}
de: {type} erkannt
